#Uygulama genel hatalari
00001|GUI Beklenmeyen Sistem Hatas\u0131
10300|GUI Sunucu ba\u015Flatma an\u0131nda StartupCompletedListener s\u0131n\u0131f\u0131 kontrolleri s\u0131ras\u0131nda bir hata al\u0131nd\u0131. Lütfen server ba\u015Flang\u0131ç loglar\u0131ndan kontrollerinizi yap\u0131p durumu düzeltiniz. 
10202|GUI Sistemde {0} tipindeki obje klonlama s\u0131ras\u0131nda hata meydana geldi. Veritaban\u0131 i\u015flemi iptal edilmi\u015ftir
10202|LOG Sistemde {0} tipindeki obje klonlama s\u0131ras\u0131nda hata meydana geldi. Veritaban\u0131 i\u015flemi iptal edilmi\u015ftir
#CRUD hatalari
11016|GUI Sistemden istenen efektif tarih aral\u0131\u011F\u0131nda {0} tipindeki kay\u0131tlar\u0131 çekerken hata al\u0131nd\u0131. Ba\u015Flang\u0131ç tarihi: {1}, Biti\u015F Tarihi: {2}
11016|LOG Sistemden istenen efektif tarih aral\u0131\u011F\u0131nda {0} tipindeki kay\u0131tlar\u0131 çekerken hata al\u0131nd\u0131. Ba\u015Flang\u0131ç tarihi: {1}, Biti\u015F Tarihi: {2}
11017|GUI Sistemde istenen kayd\u0131n veritaban\u0131ndan okunmas\u0131 s\u0131ras\u0131nda beklenmeyen bir hata al\u0131nd\u0131
11017|LOG {0} @Entity nin @Pid si kullan\u0131larak select talep edilmi\u015F, ancak bu entity de @Pid kolonuna rastlanamam\u0131\u015Ft\u0131r ya da @Pid olan kolonun tipi ayr\u0131\u015Ft\u0131r\u0131lamam\u0131\u015Ft\u0131r
11018|GUI Sistemde istenen kayd\u0131n do\u011Fal tan\u0131mlay\u0131c\u0131s\u0131ndan dolay\u0131 veritaban\u0131ndan okunmas\u0131 s\u0131ras\u0131nda beklenmeyen bir hata al\u0131nd\u0131
11018|LOG {0} @Entity nin @Pid si kullan\u0131larak select talep edilmi\u015F, ancak bu entity de @Pid kolonunun Serializable subclass\u0131 olmad\u0131\u011F\u0131 gözlemlenmi\u015Ftir, kar\u015F\u0131la\u015F\u0131lan tip: {1}. Lütfen Serializable subclass\u0131 olan bir Pid kullan\u0131n\u0131n\u0131z.
11019|GUI Do\u011Fal Tan\u0131mllay\u0131c\u0131s\u0131 null olan bir okuma yap\u0131lamaz. Lütfen bu parametre için en az bir de\u011Fer giriniz
11019|LOG {0} tablosuna P\u0131d = null ile select al\u0131namaz
11020|GUI {0} i\u015Flemindeki ve  {0} tipindeki objesi için l\u011Ftfen efektif ve perspektif tarih aral\u0131klar\u0131n\u0131 tam olarak (kayd\u0131n ba\u015Flang\u0131ç ve biti\u015Flerini) giriniz
11020|LOG {0} i\u015Flemindeki ve  {0} tipindeki için l\u011Ftfen efektif ve perspektif tarih aral\u0131klar\u0131n\u0131 tam olarak (kayd\u0131n ba\u015Flang\u0131ç ve biti\u015Flerini) giriniz. toString() ile objenin string hali: {1}
11021|GUI Sistemde {1} tipindeki obje için bir {0} operasyonu s\u0131ras\u0131nda beklenmedik bir veritaban\u0131 hatas\u0131 meydana geldi 
11021|LOG Sistemde {1} tipindeki obje için bir {0} operasyonu s\u0131ras\u0131nda beklenmedik bir veritaban\u0131 hatas\u0131 meydana geldi. Bu entity nin Pid CRUD özelliklerini kullanabilmesi için bir adet @Pid li kolonu olmas\u0131 gerekmektedir.
11022|GUI {0} i\u015Flemindeki ve {1} tipindeki objenin perspektif biti\u015F tarihi perspektif ba\u015Flang\u0131. tarihinden önce olamaz  
11022|LOG {0} i\u015Flemindeki ve {1} tipindeki objenin perspektif biti\u015F tarihi perspektif ba\u015Flang\u0131. tarihinden önce olamaz. Mevcut objenin toString(): {2}
11023|GUI {0} i\u015Flemindeki ve {1} tipindeki objenin efektif biti\u015F tarihi efektif ba\u015Flang\u0131. tarihinden önce olamaz  
11023|LOG {0} i\u015Flemindeki ve {1} tipindeki objenin efektif biti\u015F tarihi efektif ba\u015Flang\u0131. tarihinden önce olamaz. Mevcut objenin toString(): {2}
11024|GUI {0} i\u015Flemindeki ve {1} tipindeki objenin perspektif biti\u015F sistem biti\u015F tarihinden önce olamaz (Y\u0131l = 2100, Aralik 31, 23:59:59)
11024|LOG {0} i\u015Flemindeki ve {1} tipindeki objenin perspektif biti\u015F sistem biti\u015F tarihinden önce olamaz (Y\u0131l = 2100, Aralik 31, 23:59:59). Mevcut objenin toString(): {2}
11025|GUI Sisteme kaydedilen {0} tipindeki objenin do\u011Fal id si ilgili sekans\u0131n sonraki de\u011Ferinden beslenmelidir o yüzden null gönderilmelidir
11025|LOG Sisteme kaydedilen {0} tipindeki objenin do\u011Fal id si ilgili sekans\u0131n sonraki de\u011Ferinden beslenmelidir o yüzden null gönderilmelidir. Mevcut objenin toString(): {1}
11026|GUI Sisteme kaydedilen {0} tipindeki objenin do\u011Fal idsinin doluluk kontrolü yap\u0131l\u0131rken hata meydana geldi
11026|LOG Sisteme kaydedilen {0} tipindeki objenin do\u011Fal id'sinin doluluk kontrolü yap\u0131l\u0131rken hata meydana geldi. Mevcut objenin toString(): {1}
11027|GUI Sisteme kaydedilen {0} tipindeki objenin do\u011Fal id'sine de\u011Fer atarken hata meydana geldi
11027|LOG Sisteme kaydedilen {0} tipindeki objenin do\u011Fal id'sine de\u011Fer atarken hata meydana geldi. Mevcut objenin toString(): {1}
11028|GUI {0} i\u015Flemindeki ve {1} tipindeki obje null olamaz. Bu i\u015Flem ba\u015Fara\u0131yla gerçekle\u015Ftirilememi\u015Ftir
11028|LOG {0} i\u015Flemindeki ve {1} tipindeki obje null olamaz. Bu i\u015Flem ba\u015Fara\u0131yla gerçekle\u015Ftirilememi\u015Ftir
11029|GUI Sistemdeki objelerden birisinin tipi tespit edilemedi\u011Finden, veritaban\u0131 i\u015Flemi ba\u015Far\u0131yla gerçekle\u015Ftirilememi\u015Ftir
11029|LOG @Pid Utilitysini kullanan bir entity nin Pid kolonu ile ilgili bilgiler sistem haritas\u0131ndan çekilmeye çal\u0131\u015F\u0131l\u0131rken null class tipi ile sorgumala yap\u0131lm\u0131\u015Ft\u0131r. Class tipinin ba\u015Far\u0131l\u0131 bir \u015Fekilde ilgili metoda verildi\u011Finden emin olunuz. 
11030|GUI Mevcut veri i\u015Flemi null de\u011Ferli bir {0} tipindeki obje üzerinde Pid i\u015Flemi yap\u0131lamayaca\u011F\u0131ndan iptal edilmi\u015Ftir 
11030|LOG Mevcut veri i\u015Flemi null de\u011Ferli bir {0} tipindeki obje üzerinde Pid i\u015Flemi yap\u0131lamayaca\u011F\u0131ndan iptal edilmi\u015Ftir
11031|GUI Sistemde g\u00fcncellenmesi beklenen {1} do\u011fal id'li bir {2} kayd\u0131na rastlanamam\u0131\u015ft\u0131r
11031|LOG Sistemde g\u00fcncellenmesi beklenen {0} kolonu {1} olan {2} kayd\u0131na rastlanamam\u0131\u015ft\u0131r
11032|GUI {0} i\u015Flemindeki ve {1} tipindeki objenin efektif biti\u015F sistem biti\u015F tarihinden önce olamaz (Tarih = 2100, Aralik 31, 23:59:59). Bu de\u011feri sistemin otomatik ayarlamas\u0131 i\u00e7in null da b\u0131rakabilirsiniz
11032|LOG {0} i\u015Flemindeki ve {1} tipindeki objenin efektif biti\u015F sistem biti\u015F tarihinden önce olamaz (Tarih = 2100, Aralik 31, 23:59:59). Mevcut objenin toString(): {2}